docs/capstone/evidence/k6-load-50vu-5min.txt
    ✗ 'rate<0.01' rate=69.38%


  █ TOTAL RESULTS 

    checks_total.......: 7564   24.906397/s
    checks_succeeded...: 28.83% 2181 out of 7564
    checks_failed......: 71.16% 5383 out of 7564

    ✗ feed 200
      ↳  25% — ✓ 737 / ✗ 2103
    ✗ feed returns data
      ↳  25% — ✓ 737 / ✗ 2103
    ✗ teacher photos 200
      ↳  0% — ✓ 0 / ✗ 492
    ✓ dashboard 200
    ✗ photo detail 200 or 404
      ↳  27% — ✓ 263 / ✗ 685

    CUSTOM
    feed_payload_bytes.............: avg=3908     min=3908     med=3908   max=3908  p(90)=3908  p(95)=3908 

    HTTP
    http_req_duration..............: avg=570.21ms min=158µs    med=1.19ms max=6.28s p(90)=1.77s p(95)=2.37s
      { expected_response:true }...: avg=1.6s     min=236.22ms med=1.46s  max=6.28s p(90)=2.8s  p(95)=3.3s 
      { name:GET /feed }...........: avg=420.61ms min=158µs    med=1.03ms max=4.09s p(90)=1.63s p(95)=1.89s
    http_req_failed................: 69.38% 3280 out of 4727
    http_reqs......................: 4727   15.564852/s

    EXECUTION
    iteration_duration.............: avg=2.55s    min=1s       med=2.42s  max=8.13s p(90)=3.97s p(95)=4.55s
    iterations.....................: 4724   15.554973/s
    vus............................: 1      min=0            max=50
    vus_max........................: 50     min=50           max=50

    NETWORK
    data_received..................: 8.9 MB 29 kB/s
    data_sent......................: 4.8 MB 16 kB/s



running (5m03.7s), 00/50 VUs, 4724 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  5m0s
time="2026-08-16T08:36:44+05:30" level=error msg="thresholds on metrics 'http_req_duration{name:GET /feed}, http_req_failed' have been crossed"

[exited with code 0]